Revit 2024 API
Workset Members
The Workset type exposes the following members.
Methods
Name | Description
Create
 Creates a new workset.
Dispose |  (Inherited from WorksetPreview.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Id
 Id of the workset.
 (Inherited from WorksetPreview.)
IsDefaultWorkset
 Whether the workset is the default one.
 (Inherited from WorksetPreview.)
IsEditable
 Whether the workset is editable.
IsOpen
 Whether the workset is open (rather than closed).
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from WorksetPreview.)
IsVisibleByDefault
 Whether the workset is visible by default.
Kind
 Kind of the workset.
Name
 Name of the workset.
 (Inherited from WorksetPreview.)
Owner
 User name of the workset.
 (Inherited from WorksetPreview.)
UniqueId
 UniqueId of the workset.
 (Inherited from WorksetPreview.)
See Also
Workset Class
Autodesk.Revit.DB Namespace